{
  "timeline": [
    {
      "title": "FullStack Software Engineer",
      "company": "Paragon",
      "location": "California, US",
      "remote": true,
      "started": "2024-11-18",
      "ended": "2025-09-30",
      "description": "As a Full Stack Engineer at Paragon, I optimized cloud infrastructure, resolved production-critical issues, and designed modular, pluggable architectures while collaborating with cross-functional teams to deliver resilient, production-ready systems."
    },
    {
      "title": "Lead Software Engineer",
      "company": "LP360",
      "location": "Alabama, US",
      "remote": true,
      "started": "2022-09-01",
      "ended": "2024-11-01",
      "description": "Led a cross-functional team, wrote project documentation, conducted performance reviews, mentored junior engineers, performed interviews, addressed technical issues, collaborated with UI/UX designers, and designed highly scalable systems/web applications."
    },
    {
      "title": "Senior Software Engineer",
      "company": "LP360",
      "location": "Quebec, CA",
      "remote": true,
      "started": "2021-04-01",
      "ended": "2022-09-01",
      "description": "Enhanced large internal systems, added features, maintained legacy systems, developed and documented products for thousands of customers. Designed RESTful web API and integrated third-party services for online payments, mailing, reporting."
    },
    {
      "title": "Senior Software Engineer",
      "company": "Mixart",
      "location": "Santo Domingo, DO",
      "remote": false,
      "started": "2021-04-01",
      "ended": null,
      "description": "Mentored junior developers, cultivating a culture of continuous learning. Contributed to architectural decisions, balancing short-term needs with long-term scalability. Collaborated with UI/UX designers to implement visually appealing interfaces. Designed and developed a responsive web video game using HTML, CSS, and React."
    },
    {
      "title": "Full Stack Engineer",
      "company": "OrionTek",
      "location": "Santo Domingo, DO",
      "remote": false,
      "started": "2019-10-01",
      "ended": "2021-04-01",
      "description": "Managed diverse projects encompassing project tracking, food shopping, and delivery tracking. Implemented best practices across projects, enhancing overall efficiency. Established and maintained continuous integration and delivery pipelines for streamlined development processes."
    },
    {
      "title": "Software Developer",
      "company": "IKEA",
      "location": "Santo Domingo, DO",
      "remote": false,
      "started": "2019-04-04",
      "ended": "2019-10-01",
      "description": "Developed and launched features, provided tech support, reduced downtime, and improved system performance through successful integration, including training sessions for decreased user error rates."
    }
  ]
}
